---
title: Оценка студентов по завершенному проекту
order:
---

## Предусловия:

- Пользователь авторизован как "Сотрудник института"

- Пользователь является наставником или сонаставником проекта со статусом "Активный"

## Шаги:

1. Пользователь нажимает на кнопку "Мои проекты".

2. В открывшемся списке проектов пользователь выбирает нужный проект.

3. Пользователь нажимает на кнопку "Сформировать результаты".

4. В открывшейся форме пользователь заполняет блок "Результат проекта".

5. Пользователь отвечает на вопрос "Достиг ли проект поставленных целей?", выбирая один из перечисленных вариантов.

6. Пользователь нажимает кнопку "Сохранить".

7. Отображается новое окно со списком студентов.

8. Для каждого студента в списке пользователь выполняет следующие действия:

  8.1. Вводит оценку для студента.

  8.2. Нажимает кнопку "Добавить навыки".

  8.3. В открывшемся окне выбирает навыки из предложенного списка или добавляет свои (если не нашел в списке).

  8.4. Подтверждает добавление навыков (нажимает "Добавить").

9.  Пользователь завершает оценку (нажимает кнопку "Сохранить").

## Ожидаемый результат:

- Результаты проекта сохранены.

- Оценки студентов сохранены.

- Навыки (выбранные или собственные) добавлены к профилю студента.

- Студенты видят свои оценки и навыки в личном кабинете.
